<article>
<p><strong>ما يجب أن تعرفه عن البرمجة</strong></p>
<br><br><br>
<p style="text-align: right;">سأتطرق في هذه التدوينة لموضوع "البرمجة", لن نتعلم البرمجة فعليا, لكن سنهيء المبتدئين والغير مبرمجين لدخول هذا الميدان بالطريقة الصحيحة, وسنساعد المبرمجين ذوي الخبرة للتخلص من العادات السيئة واكتساب مهارات جيدة, وطرق جديدة في التفكير البرمجي.</p>
<p style="text-align: right;">الموضوع سيكون على شكل فقرات, كل فقرة تجيب على الأسئلة الآتية, وهاته الفقرات ستكون مرتبة حسب تسلسل الأسئلة, لنسهل عليك عزيزي القارئ الوصول لما تريده دون الإضطرار لقراءة المقالة كاملة.</p>

<p style="text-align: right;">&nbsp;</p><img src="<?= img_url('coding/1.jpg')?>" height="383px" width="626px"><br><br><br>

<p>&nbsp;</p>
<p style="text-align: right;">1- ماهي البرمجة؟ 2- ماهي اللغات البرمجية؟ 3- كيف أختار لغة البرمجة التي تناسبني؟ 4- كم من الوقت أحتاج لتعلم لغة برمجية؟ 5- هل يمكن تعلم أكثر من لغة في نفس الوقت؟ 6- هل أنتقل من لغة برمجية لأخرى؟ 7- هل أداء البرنامج مهم؟ 8- مشكلة عدم إكمال البرامج؟</p>
<p style="text-align: right;">&nbsp;</p>
<ul style="text-align: right;">
<li>البرمجة ببساطة هي كتابة أكواد (دعنا نسميها حاليا أكواد) تطلب بها من الحاسوب القيام بأشياء معينة. هنالك من سيقول لي أستطيع فعل ذلك بالفأرة ولوحة المفاتيح, إذن سأطلب منه أن يفتح موقعا إلكترونيا, أول ما سيفعله هو فتح المتصفح وإدخال رابط الموقع.</li>
</ul>
<p style="text-align: right;">المتصفح يسمى برنامجا, أي أنه قد تمت برمجته ( كتبت أكواده) ليطلب موقعا عند كتابة رابطه, ونفس الشيء ينطبق على كل البرامج التي لديك.</p>

<img src="<?= img_url('coding/3.jpg')?>" height="383px" width="626px">
<p style="text-align: right;">&nbsp;</p>

<ul style="text-align: right;">
<li>ماهي اللغة البرمجية؟ أولا قبل أن أوضح ماهي اللغات البرمجية, دعنا نسأل أنفسنا لما نحتاجها؟ طبعا نحتاجها لنطلب من الحاسوب أن يفعل شيئا, أي أننا نتحاور مع الحاسوب, هنالك سؤال آخر يطرح نفسه, ماهي اللغة التي يتكلمها الحاسوب؟ الحاسوب يعرف شيئان فقط 1 و 0 , أو ما يسمى بالنظام الثنائي, فمثلا لو أردنا قول" hello" للحاسوب فعلينا كتابة 01101000 01100101 01101100 01101100 01101111 وهذا أمر صعب, كأنك تحاول أن تكلم صينيا, في هذه الحالة علينا ان نحظر مترجما, لكن في العالم الإفتراضي, يجب أن تتحدث مع المترجم بلغته التي هي طبعا أسهل من لغة الحاسوب, هنالك عدة مترجمات وبالتالي عدة لغات, وهذه اللغات هي لغات البرمجة. وكإضافة في هذه الفقرة, سأوضح كيف نطلب من الحاسوب القيام بأمر عن طريق المترجم.</li>
</ul>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">&nbsp;</p><img src="<?= img_url('coding/4.jpg')?>" height="383px" width="626px">

<ul style="text-align: right;">
<li>كيف أختار لغة البرمجة التي تناسبني؟ كما سبق أن قلت, هنالك عدد من المترجمات, وقلت أنه يوجد العديد من لغات البرمجة. هنا, وكمبتدأ سترغب في إختيار أفضل لغة برمجية. لكن أنا سأقول لك أنه لا يوجد لغة أفضل من الأخرى, لأنه قبل الخوض في ميدان البرمجة, عليك أن تحدد ما الذي تريد أن تبرمج له, حيث هنالك عدّة مجالات, فهناك برمجة الويب أي المواقع وصفحات الويب أي المواقع وصفحات الأنترنت وقواعد البيانات ..., هنالك البرامج المكتبية, هنالك الألعاب, هنالك الهواتف الذكية كالأندرويد والأيفون... لذلك يجب أن تختار المجال أولا, بعد المجال يجب أن تبحث عن كل اللغات التي تشتغل فيه ثم بعد ذلك عن مميزات كل اللغة, هنالك من لن يفهم ما أقصده بالمميزات, لا بأس, ما قصده هو هل أن اللغة مفتوحة المصدر أم لا ( أي يمكن الإطلاع عليها وكيف تمت كتابتها), ما هي المنصات التي تشتغل عليها هذه اللغة أي ماهي أنظمة التشغيل التي تشتغل عليها, مدى سهولة اللغة, مدى طلب اللغة في الشركات والأسواق... للإشارة فقط, يمكن أن تكون لغة واحدة في عدّة مجالات, فمثلا يمكن أن تبرمج بلغة الجافا برامجا مكتبية ومواقع أنترنت وألعاب وكذلك تطبيقات الأندرويد.</li>
<li>كم من الوقت أحتاج لتعلم لغة برمجية؟ عملية التعلم ليست محصورة على وقت معين, لكن حاول أن تعطي للغة وقتا كافيا حتي تحس أنك أتقنت الأساسيات ومن الضروري جدا أن تطبق ما تعلمته حتى ولو تراه بسيطا وتراه سخيفا. فرضا أن لدينا متعلمين إثنين, الأول تعلم لغة ما في أسبوع وبدأ في بناء برمجياته, بينما المتعلم الثاني أخذ مدة شهرين أو ثلاث في تعلم الأساسيات , صدقني إن المتعلم الثاني سيبني &nbsp;برامج أفضل و أقوى من الأول, وللأشارة اللغات البرمجية تختلف أي أن مدة تعلم كل واحدة ستختلف عن الأخرى.</li>
<li>هل يمكن تعلم أكثر من لغة في نفس الوقت؟ هذا أحد أكبر الأخطاء الذي يقع فيه الكثيرون وخصوصا الجدد في البرمجة. وسأقول لك لماذا. أولا أنت حددت الذي ترغب في البرمجة فيه (الفقرة الثالثة), واخترت اللغة البرمجية, إذن ما الحاجة للغة أخرى ؟؟&nbsp;!! ثانيا قد تبدأ في الخلط بين syntax هذه اللغة واللغة الأخرى. ثالثا عملية التعلم ستكون أبطأ. إذن الجواب لا, لا تحاول تعلم عدّة لغات برمجية في نفس الوقت.</li>
</ul>
<p style="text-align: right;">&nbsp;</p>

<img src="<?= img_url('coding/2.jpg')?>" height="383px" width="626px">
<p style="text-align: right;">&nbsp;</p>

<ul style="text-align: right;">
<li>هل أنتقل من لغة برمجية لأخرى؟ يمكن أن يكون خطأ فادحا ومضيعة للوقت أو تطورا وزيادة في المعرفة والمهارات. الإنتقال من لغة لأخرى من الأمور التي يجب الحذر فيها, حيث لو تعلمت لغة برمجية لا يجب الإنتقال للغة أخرى الا اذا أتقنت الأولى وبنيت بها برامج, بعد ذلك ستجد أن اللغة الأخرى سهلة سيكون الإختلاف في طريقة كتابة اللغة Syntax و طبعا سيزداد عليها بعض التغييرات حسب المجال, لكن ستجد انه من السهل التعامل مع اللغة الجديدة. لذلك إحرص أن تبني برامج باللغة الأولى قبل الإنتقال للغة ثانثة وإلا فستكون قد ضيعت وقت تعلم اللغة الأولى هباءا.</li>
</ul>

<p style="text-align: right;">&nbsp;</p><img src="<?= img_url('coding/5.jpg')?>" height="383px" width="626px">

<p style="text-align: right;">&nbsp;</p>
<ul style="text-align: right;">
<li>هل أداء البرنامج مهم؟ كبداية, سواء كنت مبتدأ أو محترفا فأداء البرنامج ليس مهما في البداية, حيث أول ما يجب فعله هو بناء البرنامج, وعندما أقول بناء البرنامج يجب أن يكون مكتوبا بطريقة منظمة لأنه تنظيم البرنامج وإمكانية قراءة الكود المصدري الخاص به يعد نجاحا في الأداء, لأنه سيسهل بعد ذلك التحليل, وبالتالي إيجاد طرق لتقليل إستهلاك الذاكرة, بناء واجهة بسيطة, إيجاد الأخطاء المنطقية, إيجاد الثغرات... المهم هو أن تنسى الأداء والثغرات والتركيز على تنظيم الكود وسهولة قراءته في البداية, ثم بعد إكمال البرنامج, الإهتمام بالأداء.</li>
</ul>
<p style="text-align: right;">&nbsp;</p>




<ul>
<li style="text-align: right;">مشكلة عدم إكمال البرنامج؟ هذه إحدى المشاكل التي يعاني منها الكثير من المبرمجين وخصوصا مبرمجي الويب الذين يحاولون الوصول لبرامج تنافس برامج قوية كسكريبت جوملا أو في بي... لذلك كنصيحة مني, ابدأ البرنامج بأقل الإمكانيات ليشتغل, أي يجب أن لا تتعمق في البرنامج في البداية وأن تكتبه ليشتغل في البداية فقط, وأهم شيء هو أن يكون الكود منظما, والبرامترات والدوال تأخذ أسماء تناسبها وليس أسماء عشوائية, وأفضل الأسماء هي تلك التي تدل على عمل الدالة أو الكلاس أو البرامتر مع كتابة الملاحظات لأنه أمر مهم جدا.</li>
</ul>

</article>