<article>
	<p><strong>إبدأ بتصميم الواجهة قبل البرمجة</strong></p>
	
	<p style="text-align: right;">ينصح خبراء التسويق بالتركيز على المنافع والفوائد في الحملات التسويقية وليس على المميزات.</p>
	<p style="text-align: right;">فالمستخدم, سواء العادي أو حتى المحترف, لايفهم دائما التفاصيل التقنية وهو غير مهتم بها بقدر ماهو مهتم بالفوائد التي سيجنيها من ذلك المنتج أو تلك الخدمة. مثلا الباحث عن جهاز كمبيوتر محمول لا يهمه أن تقول له أن البطارية من نوع ليثيوم, ما يهمه هو أن تقول له أن البطارية توفر له – مثلا – سبع ساعات من التشغيل المتواصل.</p>
	<p style="text-align: right;">فالمستخدم, مالم يكن متخصصا جدا, لايبحث عن التفاصيل التقنية للميزات قدر ما يبحث عن الفوائد التي ستشبع إحتياجاته من المنتج.</p>
	<p style="text-align: right;"></p><img src="<?= img_url('frontend/3.jpg')?>" height="383px" width="626px">
	<p style="text-align: right;">نفس الفكرة يمكن تطبيقها في مجال تطوير المواقع. أغلب أصحاب المشاريع يضيعون الكثير من الوقت في البحث عن التقنيات الجديدة المناسبة ثم يبدأون بالبرمجة ويتركون تصميم واجهات المستخدم إلى النهاية, وغالبا ما يتم إنجاز التصميم بدقة أقل وخلال وقت أقصر بسبب الوقت الطويل الذي ضاع في البرمجة.</p>
	<p style="text-align: right;"><img src="<?= img_url('frontend/1.png')?>" height="383px" width="626px"></p>
	<p style="text-align: right;">السؤال هنا: ما الذي يهم المستخدم حقا؟ المستخدم لا يهمه ما لغة البرمجة الخارقة التي استخدمتها ولا الخوارزميات العبقرية ولا جمالية الكود البرمجي. ما يهم المستخدم هو أن يعمل الموقع بشكل سليم وأن يكون سهل التصفح. بالنسبة للمستخدم الواجهة أهم, لذلك هي ما يجب أن تركز عليه أكثر. لا بأس أن يكون الكود البرمجي بشعا ومليئا بالثغرات في البداية, تلك الأمور قابلة للإصلاح بسهولة دون أن تزعج المستخدم, عكس الأخطاء الفادحة في التصميم التي تعرقل من تجربة المستخدم.</p>
	<p style="text-align: right;">ما أقصده بالتصميم هنا ليس مخططات الصفحات, بل التصميم الفعلي والكامل لواجهات المستخدم بـ HTML مع تضمين الواجهات النصوص الحقيقية للمحتوى الذي سيتوفر لاحقا في الموقع.</p>
	<p style="text-align: right;"><img src="<?= img_url('frontend/2.jpg')?>" height="383px" width="626px"></p>
	<p style="text-align: right;">حين تبدأ بالتصميم فأنت تحصل على رؤية واقعية عن منتجك/ موقعك قبل البدء في برمجته.</p>
	<p style="text-align: right;">الفكرة تصبح واضحة ويمكن آنذاك تحديد الأولويات والأجزاء الأهم في الموقع التي تحتاج أن تبدأ بها. يمكنك أن تعرض الواجهات على المستخدمين المتوقعين وتحصل على آرائهم في منتجك قبل أن تكتب سطرا برمجيا واحدا. التعديل على التصميم سهل. يمكنك تلقي الإقترحات و الملاحظات وإجراء كل التعديلات بسرعة. ثم حين تبدأ في البرمجة ستكون الأمور واضحة جلية أمامك.</p>
</article>