<article>
<img src="<?php echo img_url('ia/1.png');?>" width="700px"/>
<p style="text-align: right;">" لما لا يمكنك السيطرة على العالم؟</p>
<ul style="text-align: right;">
<li>لا أعرف ماذا سأفعل به على كل , أنا مشغولة جدا الآن "</li>
</ul>
<p style="text-align: right;">سنة 1950 نشر عالم الرياضيات البريطاني "آلان ماثيسون تيورنغ" ورقة بحثية بعنوان " الآلات الحاسبة والذكاء الإصطناعي Computing Machinery and Intelligence" يشرح فيها فكرة جديدة لإختبار الآلة, فبغض النظر عن الأسئلة الكبيرة كـ "هل يمكن أن تفكر الآلة؟" و"هل يمكن أن تمتلك وعيا؟" و"ماهو الوعي أصلا؟". يمكن لنا كبداية أن نختزل كل تلك الأسئلة في سؤال واحد أكثر بساطة: "هل يمكن للكومبيوتر أن يتحدث كبشري؟"</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">إذا تمكنت الآلة من محاكاة طريقة البشر في الحديث , فربما نحن على الطريق فعلا لصنع آلة قادرة على التفكير فاللغة, وإقامة حوارات مع آخرين بنمط يبدو عشوائيا , غير ذي وتيرة ثابتة , وسؤالهم على أحوالهم, أو عن أخر خطوط الموضة, أو عن الطقس الآن, ربما هو أحد أهم الدلالات على قدرتنا كبشر على التفكير, كانت تلك هي نشأة ما نسميه "اختبار تيورينغ Turing test</p>
<p style="text-align: right;">لنفترض أن أحدهم يجلس في غرفة مغلقة, سوف نسميه "المحقق interrogator", يتحدث المحقق عبر أحد تطبيقات التواصل على شاشة الكمبيوتر مع شخصين آخرين, لا يعرفهما ولا يراهما, كل مايصله هو ردود على أسئلته في نافذة على الشاشة, بالضبط كما يحدث عندما تتحاور مع صديق لك عبر رسائل فيسبوك أو واتس أو فايبر. لنفترض الآن أن أحد هذين الشخصين هو آلة , والمحقق يعرف ذلك , تقوم تلك الآلة بمعالجة كلمات المحقق , ثم الرد عليه بردود محددة وظيفتها خداع هذا المحقق, وإيهامه أن من يتحدث معه هو شخص وليس آلة , إذا لم يستطع المحقق خلال مدة محددة أن يعرف أيا من يحاوره هو الإنسان, وأيا منها هو الآلة, يمكن عندها القول إن الآلة نجحت في محاكاة البشر, نحن إذا أمام لعبة محاكاة Imitation game , من هنا استلهم "مولتين تيلدوم" عنوان فيلمه الشهير.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">يقول تيورنغ:</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">"أعتقد أنه خلال 50 سنة سوف يكون من الممكن برمجة حواسيب بقدرات تخزينية تفوق الـ106 سوف تمكنهم من لعب "لعبة المحاكاة" بشكل جيد للدرجة التي سوف تجعل متوسط المحققين ينجح فقط في التعرف على الآلة في 70% من الحالات بعد 5 دقائق من استجوابهم"</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">على مدى زمني ليس بطويل ظهرت العديد من النماذج المحوسبة لمحاولة اجتياز اختبار "تيورنغ" كالبرنامج إليزا Eliza الشهير، وهو نموذج ذكي وبسيط؛ يعمل عبر محاكاة نمط مُعالج نفسي يحث المحققين للكلام، ثم يعكس أسئلتهم ويردها إليهم مرة أخرى، كأن تقول "أريد أن أذهب إلى أمي" فترد عليك إليزا: "أخبرني أكثر عن ذلك، لماذا تريد أن تذهب إلى أمك الآن؟" استمرت المحاولات حتى وصلنا مؤخرا في 2014 للنموذج "يوجين جوستمان" Eugene Goostman الذي استطاع اجتياز اختبار "تيورنغ" عبر محاكاة مراهق أوكراني و خداع 33% من المحققين، قبل ذلك نجح النموذج Pc Therapist وكذلك النموذج Cleverbot في خداع المحققين في عدة مسابقات..</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">ما يهمنا الآن هو التساؤل الأكثر أهمية: إذا استطعنا حقا صنع آلات تتمكن من اجتياز اختبار "تيورنغ" إن استطعنا صنع آلة نتمكن من التعامل معها؛ بحيث لا نشك للحظة أننا نتحدث مع آلة، هل هنا يمكن القول إننا حصلنا على "ذكاء"؟</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">سنة 1980 (وفي محاولة رصينة للإجابة عن السؤال الأخير) نشر الفيلسوف الأمريكي "جون سيرل"2 ورقة بحثية بعنوان "العقول، الأمخاخ، والبرامج"Minds, Brains, and Programs&nbsp; يشرح فيها تجربة فكرية سمّاها "مشكلة الغرفة الصينية" Chinese Room Argument، إلى الآن لا تزال تلك الحجة التي ألقى بها "جون سيرل" هي مركز النقد الموجه للادعاءات المسماة في مجموعها "الذكاء الصناعي القوي" Strong AI، و هو -بتعبير سيرل- الظن أن برمجة آلة ما بشكل مناسب يمكّنها من معالجة جيدة للمدخلات وإعطاء المخرجات يمكن له صناعة عقل يشبه عقل البشر، إنه القول بأن الآلة قد امتلكت وعيا أو أنها تفكر، أو تلك الادعاءات التي تختزل الوعي البشري في عمليات إدخال وإخراج&nbsp; ومعالجة بيانات فقط.</p>
<img src="<?php echo img_url('ia/2.png');?>" width="700px"/>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">لنفترض أن "سيرل" موجود الآن في غرفة مغلقة، خارج الغرفة يوجد شخص يتحدث الصينية فقط، و يسأل "سيرل" عبر رسائل مكتوبة يمررها من فتحة صغيرة في أحد جوانب الغرفة، ليكن سؤال صديقنا الصيني مثلا هو "هل تتحدث الصينية؟"، تدخل الرسالة لسيرل. مع سيرل كتاب ضخم، في الكتاب توجد مجموعة من القوانين، أحدها مثلا يقول: إذا رأيت الرمز "x" .. اكتب الرمز "y"، و إذا رأيت الرمز "z" .. اكتب الرمز "m"، و هكذا حتى تنتهي الرسالة، سوف يعيد "سيرل" إرسالها عبر الفتحة للشخص في الخارج، هذا الرجل الصيني في الخارج سوف يقرأ مثلا جملة تقول بالصينية: "نعم، إنها لغة صعبة لكنها رائعة"، فيقتنع أنه بالفعل يقف أمام متحدث بارع للصينية..</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">سوف يقرر إرسال رسالة جديدة تقول: "بالفعل، كم من الوقت أخذت في تعلمها؟"، فيتبع "سيرل" نفس القاعدة وبعد وقت قصير يعيد رسالة تقول بالصينية "6 سنوات". هنا يقتنع الصيني تماما أنه -بالفعل- يتحدث مع شخص يتحدث الصينية بطلاقة، لكن.. هل هذا صحيح؟</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">طبعا لا، "سيرل" في الغرفة لا يعرف الصينية، لا يفهم ما يعنيه أي من تلك الأشكال الغريبة، إنه فقط يستخدم كتاب القواعد الموجود معه في الغرفة، كذلك يمكن أن نطبق تلك القاعدة على الآلة، فحينما&nbsp; يتحدث معك إنسان آلي ما -في الجهة الأخرى من غرفة اختبار تيورنغ- بنمطٍ غايةٍ في الاحترافية، فهو مهما بلغ من قدرة حسابية، ومهما بلغ من قدرات على المحاكاة، لا يفكر، لم يفكر ولا لحظة واحدة..</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">هو لا يعي ما تعنيه تلك الجمل كـ"كيف الطقس اليوم؟"، "ما هي ميولك الدينية؟"، أو "هل سوف تنتخب ترامب؟"، أو الجملة في أول المقال3 "لما لا يُمكنك السيطرة على العالم؟" والتي سألها أحد المحققين في أحد مسابقات "لوبنر" الشهيرة؛ بينما كانت إجابة الآلة هي: "لا أعرف ماذا سوف أفعل به؟! على كلٍ، أنا مشغولة جدا الآن" وهو ما أقنع المحقق أنه يتحدث بالفعل مع بشري مثله؛ لكن كل ما تفعله الآلة هنا هو اتباع نمط بقواعد منطقية محددة، وتقوم بعكسه ناحيتك؛ لكنها لا تفهم ما يعني ذلك.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">دعنا الآن -قبل الخوض في إشكاليات أكثر عمومية- نحاول تحقيق فهم أفضل لتلك الفكرة عبر دراسة نمط أبسط آلة ممكنة، إنها الآلة الحاسبة التي نستخدمها يوميا في حسابات الجمع والطرح والضرب والقسمة وربما بعض المستويات الأعلى، حينما يسألك صديق ما عن "جمع 3 + 2" فربما ما سوف تفعله هو التالي: سوف تتخيل تفاحتين، مثلا، و ثلاثة تفاحات، وسوف تعد كل التفاحات معا، أنت هنا تفهم ما يعنيه رقم "2" وما يعنيه رقم "3" وما تعنيه عملية الجمع في الأساس، أما الآلة فسوف تستخدم نمطا مختلفا تماما؛ فهي تتبع قاعدة تقول إنه إذا ظهر الرمز"3" ثم بعدها الرمز "+" ثم الرمز "2" فيجب أن تطبع الرمز "5"، إنها لا تفهم أي شيء مما تعنيه تلك الرموز، ولا تعرف الفرق بين + و 2، بالضبط؛ كما لا يفهم "سيرل" الصينية.</p>
<img src="<?php echo img_url('ia/3.png');?>" width="700px"/>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">الآلة إذن، بتعبير "سيرل"، تتحدث بطريقة نحوية، وليست دلالية syntactic not semantic، دعنا نختبرها كقضية منطقية4:</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">1-&nbsp;&nbsp;&nbsp; الآلة صورية تماما (Syntactic نحوية، لها علاقة ببناء الجمل).</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">2-&nbsp;&nbsp;&nbsp; للبشر مكونات عقلية (Semantic دلالية أو ذات معنى).</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">3-&nbsp;&nbsp;&nbsp; بناء الجمل (Syntax) لا يمكن له أن يكون مؤسسا أو صانعا لمكونات عقلية (Semantic).</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">4-&nbsp;&nbsp;&nbsp; بناء على ما سبق، لا يمكن للبرامج Programs أن تكون مؤسسة أو داخلة في تكوين عقول Minds.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">هذا هو بالضبط ما يقصده "سيرل" حينما ينتقد كل التصورات التي تتحدث عن ذكاء اصطناعي يشبه ذكاء البشر، أو حتى ذكاء الحيوانات، فأنا أكثر ذكاءً من القطة أو القرد مثلا؛ لكن إدخال الآلة لتلك المقارنة، وهو ما نراه دائما في مقالات أو برامج التيلفزيون التي تتحدث عن الذكاء الصناعي، حينما يخرج علينا مهندس ما ليخبرنا أن الآلة الآن ذات قدرة كتلك التي لدى الكلب وكانت منذ عدة عقود؛ كقدرة الفأر، وقريبا سوف تتخطى ذكاء الإنسان؛ هذا غير صحيح، تزايدت وتيرة هذا النمط من الحديث؛ خاصة بعد أن هزم البرنامج الشهير Deep Blue بطل العالم في الشطرنج "جاري كاسباروف" المبارة الثانية، سنة 1997. يمكن للآلة أن تقوم بـ300 مليون عملية حسابية في الثانية الواحدة؛ لكنها مهما بلغت من القدرة على الحساب إلا أنها لا تزال قطعة حديد تتلاعب بقواعد محددة في اتجاهات محددة.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">من هنا ينتقل "سيرل" لشرح سبب استخدام "تيورنغ" في ورقته الشهيرة للمصطلح Computing Machinery وليس Computers، لأننا كلنا حواسيب، كلنا -بشرا أو غير بشر- قادرين على صياغة وحل عمليات حسابية، دعني الآن أضع طبقا فوق الطاولة، هذا نوع من البرامج، إنه برنامج يقول للطبق "قف حيث أنت"، من هنا وجب علينا التفريق التام بين قدرتنا على الحساب، و قدرتنا على التفكير، فالآلة لا تفكر&nbsp; لكنها -مع ذلك- تجيب عن سؤالنا بنمط يبدو أنه ذكي، لماذا يبدو كذلك؟</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">ببساطة؛ لأننا نراه كذلك، يرى "سيرل" أن تلك التوجهات الحاسوبية computational&nbsp; ليست فقط خاطئة؛ لكنها أيضا تفتقد للوضوح، فالقدرة على الحساب ترتبط بالملاحظ Observer-Relative لكنها ليست صفة جوهرية في الحقيقة Observer-independent، فالقلم واللابتوب الذي أكتب عليه الآن، والحروف المكوِّنة لمقالي هي أمور موضوعية تتواجد في الواقع؛ بغض النظر عن وجودي الشخصي، أما تلك القواعد الحسابية التي تصنع ما نسميه ذكاءً صناعيا، فهي تظهر كمُفكرة فقط؛ لأننا نراها كذلك.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">كل شيء يمكنه امتلاك قدرات حوسبة كما قلنا عن الطبق على الطاولة منذ قليل، أما عن امتلاكه لحالة عقلية؛ فهو أمر لا يمكن اختزاله لنظرية علمية تحول العقل البشري لمجموعة قواعد ضمن حركة معالجة بيانات. الآلة لا تفكر كما نفكر، الآلة لا تختلف كثيرا عن جزيئات ماء تحولت عند الغليان من الحالة السائلة للحالة الغازية، هي الأخرى تمتلك برنامجا يخبرها أنه: "إذا بلغت درجة الحرارة 100، ابدئي في التبخر"، أما عن الوعي، فهو أمر نحتاج لفهمه أولا قبل صياغة آلات واعية، بالضبط كما استطعنا بعد فهم آلية عمل القلب البشري؛ أن نصنع قلبا اصطناعيا لم نحتج أثناء صياغته لاستخدام أنسجة بشرية، لنفهمه أولا.. ثم نتحدث عن وعي.</p>
<p style="text-align: right;">&nbsp;</p>
<p style="text-align: right;">&nbsp;</p>
</article>